# 2022년 수집 대상 키워드
keywords_2022 = ['IT', '건강', '독서', '사랑', '심리', '에세이',
    '여행', '역사', '영화', '예술', '운동', '음악', '직장생활', '창업',
     '철학', '육아', '인문학', '정치', '사진', '이별', '글쓰기', '주식',
     '부동산']

# 새롭게 추가된 2023년 수집 대상 키워드
keywords_2023 = ['해외여행', '세계여행', '요리', '맛집', '시사',
    '뉴스', 'AI', '인공지능', '인터넷', '영화리뷰', '영화평론', '책리뷰',
    '서평', '노래', '회사', '직장인', '퇴사', '취업', '이직', '직장',
    '신입사원', '상사', '스타트업', '사업', '아이', '부모', '육아에세이',
    '워킹맘', '육아이야기', '다이어트', '요가', '필라테스', '헬스',
    '심리학', '심리치료', '심리분석', '디자인', '디자이너', '문화', '전시',
    '공연', '뮤지컬', '연극', '건축', '니체', '소크라테스', '전쟁', '전쟁사',
    '조선', '문명', '고양이', '강아지', '반려견', '반려동물', '동물',
    '연애', '짝사랑', '소개팅', '첫사랑', '남자친구', '여자친구',
    '감성에세이', '수필', '산문', '과학', '우주', '진화', '과학기술','유전자',
    '물리학', '경제', '경제학', '천문학', '양자역학', '학교', '교육',
    '컴퓨터', '미래', '추억', '언어', '미국', '트렌드', '게임', '로봇',
    '환경', '자연', '기후', '기후변화', '지구', '인권', '정의', '차별',
    '종교', '스마트폰', '칼럼' ]

kewords = keywords_2022 + keywords_2023

# 중복제거
kewords_set = set(kewords)
kewords = list(kewords_set)

# 오름차순 정렬
kewords.sort()

# 키워드 정보 출력
print(f"\n전체 키워드는 {len(kewords)}개 입니다.\n수집된 키워드:\n{kewords}")
